package HW1;

public class Main {

    public static void main(String[] args) {

        //Задание 2 - Создать переменные всех пройденных типов данных и инициализировать их значения.
        boolean bl = true;
        char ch = 666;
        char ch2 = 'X';
        String str = "HomeWork 1";
        byte b = 127;
        short sh = 32767;
        int i = 2147483647;
        long ln = 956743147483647L;
        float fl = 3.1F;
        double db = 3.215;

        System.out.println(task3(2, 3, 4, 5)); //7.6

        System.out.println(task4(5, 15)); //true
        System.out.println(task4(5, 4)); //false

       task5(-4); //Ваше число отрицательное
       task5(0); //Ваше число положительное

        System.out.println(task6(-1)); //true
        System.out.println(task6(0)); //false

        task7("Джон Уэйн"); //Привет, Джон Уэйн!!!

        task8(2028); //Год является високосным
        task8(1945); //Год не является високосным
        task8(2020); //Год является високосным

    }

    //Задание 3 - Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
    // где a, b, c, d – аргументы этого метода, имеющие тип float.
    public static float task3(float a, float b, float c, float d) {
        return a * (b + (c / d));
    }

    //Задание 4 - Написать метод, принимающий на вход два целых числа и проверяющий,
    // что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.
    public static boolean task4(int a, int b) {
        if ((a + b) >= 10 & (a + b) <= 20) return true;
        else return false;
    }

    //Задание 5 - Написать метод, которому в качестве параметра передается целое число,
    // метод должен напечатать в консоль, положительное ли число передали или отрицательное.
    // Замечание: ноль считаем положительным числом.
    public static void task5(int a) {
        if (a >= 0) System.out.println("Ваше число положительное");
        else System.out.println("Ваше число отрицательное");
    }

    //Задание 6 - Написать метод, которому в качестве параметра передается целое число.
    // Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
    public static boolean task6(int a) {
        if (a<0) return true;
        else return false;
    }
    //Задание 7 - Написать метод, которому в качестве параметра передается строка, обозначающая имя.
    // Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
    public static void task7(String str) {
        System.out.println("Привет, " + str + "!!!");
    }
    //Задание 8 - Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль.
    // Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
    private static void task8(int x) {
        if (x % 4 == 0 && x % 100 != 0 || x % 400 == 0) System.out.println("Год является високосным");
        else System.out.println("Год не является високосным");
    }




}
